//BANCOP4J JOB (COBOL),
//         ' ',
//         CLASS=C,
//         MSGCLASS=H,
//         REGION=8M,TIME=1440,
//         MSGLEVEL=(1,1),NOTIFY=HERC01
//*
//* STEP1 - ORDENA O ARQUIVO POR AGENCIA
//*
//STEP1    EXEC PGM=SORT
//SORTLIB  DD DSNAME=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSNAME=HERC01.CONTAS.TXT,DISP=SHR
//SORTOUT  DD DSNAME=&&SORTED,
//            DISP=(NEW,PASS),
//            UNIT=SYSDA,
//            SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=54,BLKSIZE=540)
//SYSIN    DD *
  SORT FIELDS=(39,4,CH,A)
/*
//*
//* STEP2 - COMPILA O PROGRAMA COBOL
//*
//STEP2    EXEC COBUCL,
//         PARM.COB='FLAGW,LOAD,SUPMAP,SIZE=2048K,BUF=1024K,LIB'
//COB.SYSPUNCH DD DUMMY
//COB.SYSIN    DD DSNAME=HERC01.COBOL(BANCOP4),DISP=SHR
//COB.SYSLIB   DD DSNAME=HERC01.COPY,DISP=SHR
//LKED.SYSLMOD DD DSNAME=HERC01.LOAD(BANCOP4),DISP=SHR
//LKED.SYSIN   DD DUMMY
//*
//* STEP3 - EXECUTA O PROGRAMA
//*
//STEP3    EXEC PGM=BANCOP4
//STEPLIB  DD DSNAME=HERC01.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//CONTAS   DD DSNAME=&&SORTED,DISP=(OLD,DELETE)
//
